# Step1: 定义一个计数器（初始化一个计数器）
# i = 0或1
# Step2: 编写while循环结构
# while 循环条件(判断 计数器 是否达到了目标位置):
# 	循环体1
# 	循环体2
# 	...
	# Step3: 在循环内部更新计数器
	# i = i + 1 或 i += 1

# while循环入门案例：使用while循环，循环输出5遍“Hello World”
# i = 0
# while i < 5:
# 	print("hello world")
# 	i += 1

# 使用while循环求1..100的和

# i = 0
# a = 0
# while i < 10 :
# 	i += 1
# 	a += i
# 	print(f"循环第{i}, 总数为{a}")

i = 1

# 2- 编写循环
while i <= 100:
    # 循环的主体内容
    # 如果值能够被30整除, 退出循环
    if i % 30 == 0:
        break

    print(i)

    # 3- 更新计数器
    i += 1

# 退出循环后, 执行后续的代码
print("111111111111111")

# 1- 定义计数器
i = 1

# 2- 编写循环
while i <= 100:
    # 循环的主体内容
    # 如果能够被5整除, 将该值跳过 不打印
    if i % 5 == 0:
        # 更新计数器:
        i += 1

        continue

    print(i)

    # 3- 更新计数器
    i += 1

# 退出循环后, 执行后续的代码
print("22222")
